bullet2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bullet
    {
        type            wall;
        nFaces          30;
        startFace       5786;
    }
    topWall
    {
        type            patch;
        nFaces          50;
        startFace       5816;
    }
    bottomWall
    {
        type            patch;
        nFaces          50;
        startFace       5866;
    }
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       5916;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       5946;
    }
    defaultFaces
    {
        type            empty;
        nFaces          7408;
        startFace       5976;
    }
)

// ************************************************************************* //
