bullet2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "p.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }

    "(U|e|R).*"
    {
        $p;
        tolerance       1e-05;
    }

    "(k|epsilon).*"
    {
        $p;
        tolerance       1e-08;
    }
}

PIMPLE
{
    nOuterCorrectors 5;
    nCorrectors      3;
    nNonOrthogonalCorrectors 1;
    //residualControl
    //{
        //U
        //{
            //tolerance 1e-5;
            //relTol 0;
        //}
        //p
        //{
            //tolerance 1e-5;
            //relTol 0;
        //}
    //}
}

relaxationFactors
{
    fields
    {
        p 0.1;
    }
    equations
    {
        "U|k|epsilon" 0.1;
    }
}


// ************************************************************************* //
